{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "",
  "home_page_url": "https://github.com/adempiere/adempiere-site.github.io/es/",
  "feed_url": "https://github.com/adempiere/adempiere-site.github.io/feed.json",
  "description": "Página oficial de la comunidad de ADempiere",
  "items": [
    {
      "title": "El futuro de ADempiere como sistema reactivo DDD",
      "url": "https://github.com/adempiere/adempiere-site.github.io/es/about/articles/2015-06-22-the-future-of-adempiere-as-a-ddd-reactive-system.html",
      "id": "https://github.com/adempiere/adempiere-site.github.io/es/about/articles/2015-06-22-the-future-of-adempiere-as-a-ddd-reactive-system.html",
      "content_html": "<p>Antes de empezar a hablar de modularidad, me gustaría describir el camino para definir la arquitectura más adecuada para un software como ADempiere.</p>\n<p>Durante los últimos años he estado leyendo y analizando los diferentes enfoques y arquitecturas para el desarrollo de software y al mismo tiempo descifrar cuál sería la mejor para ADempiere.</p>\n<p>Como todos sabemos muy bien, el diseño de nuestro programa se basa en una combinación de dos capas <a href=\"http://en.wikipedia.org/wiki/Cliente\" target=\"_blank\" rel=\"noopener noreferrer\">Cliente/servido</a> (1) Swing, que en los años noventa del el siglo pasado fue uno de los que mejor se adoptó porque utilizó la red y las PC de manera que el servidor principal se liberó de la carga pesada al dejar ciertas tareas en el cliente. El objetivo principal era que el núcleo del software se ejecutara en un servidor central mientras los clientes se conectaban a él para acceder a los datos y realizar la lógica comercial localmente.</p>\n<p>Irónicamente, creo que han regresado a donde comenzaron originalmente, ya que había un mainframe con terminales tontas que solo mostraban datos a los usuarios sin ningún tipo de procesamiento de datos complejo.</p>\n<p>No estuve presente en la época en que se necesitaba una bata blanca para acceder a grandes centros de datos formados por varios IBM 390 o Systems 36 con cientos de terminales (ATM). Pero hoy, el contexto es de alguna manera similar a estos tiempos pasados: hay grandes centros de datos -que por cierto han ayudado a reducir costos- con servidores alquilados a los que se accede de manera virtual por un par de cientos de dólares al mes (Amazon, Google Cloud, Heroku, por nombrar algunos). La principal diferencia ahora es que las aplicaciones tienen que dar servicio a miles o incluso millones de usuarios, la capacidad de poder escalar horizontalmente es un requisito habitual hoy en día; este nuevo contexto exige que las aplicaciones se diseñen de manera diferente ya que los requisitos son totalmente diferentes.</p>\n<p>El acceso a estos servidores se realiza mediante gadgets que, aunque no son totalmente tontos, ejecutan aplicaciones cliente que se ejecutan en un navegador web cuya única tarea es interpretar java script o código HTML, donde el valor más alto es la estandarización e integración de múltiples sistemas operativos y plataformas. .</p>\n<p>En la próxima década, el enfoque principal fue el desarrollo de aplicaciones basadas en el paradigma del controlador de vista modelo [MVC] (http://en.wikipedia.org/wiki/Model) (2), que permitía la separación de código.</p>\n<p>La capa del modelo permite el acceso y actualización de datos, en su mayoría guardados en una base de datos relacional. Por otro lado, permite trabajar con mapeo objeto-relacional (ORM) que consiste en una abstracción en la base de datos y persistencia, reemplazando el uso de sentencias SQL dependiendo de la implementación de un motor implementado en cada base de datos.\nLa capa de vista separa el código para la visualización y la interacción del usuario a través de una interfaz de usuario, que se implementa de acuerdo con el dispositivo de acceso.</p>\n<p>La capa de controlador se encarga de vincular la capa de vista con el modelo de datos e implementa el código que responde a las acciones necesarias.</p>\n<p>Cuando analizamos el código de ADempiere en retrospectiva, podemos ver el transcurso del tiempo y la evolución que sufrió. Se pasó del cliente/servidor original basado en Java swing con acceso directo a la base de datos a través de sentencias SQL puras al actual ORM propio combinado con SQL para acceder a los datos y la aplicación MVC basada en el cliente web AJAX.</p>\n<p>Aunque la tecnología ha avanzado, nuestro modelo de dominio ha persistido; por eso podemos inferir que el activo más importante de ADempiere es el Diccionario de Aplicaciones que preserva el modelo de dominio y la lógica de negocio.</p>\n<p>Gracias a que ADempiere fue redactado y desarrollado sobre una Arquitectura Dirigida por Modelos <a href=\"http://en.wikipedia.org/wiki/Model-driven_architecture\" target=\"_blank\" rel=\"noopener noreferrer\">MDA</a> (3), el modelo de dominio está protegido de obsolescencia por el Diccionario de Aplicaciones</p>\n<p>Como persona voluntaria, responsable de la futura arquitectura de la querida ADempiere, adoptaremos el enfoque DDD como línea principal de desarrollo.</p>\n<p><strong>Ahora: ¿qué es un desarrollo de software guiado por el <a href=\"http://en.wikipedia.org/wiki/Domain-driven_design\" target=\"_blank\" rel=\"noopener noreferrer\">DDD de Diseño Impulsado por Dominio</a>(4)?</strong></p>\n<p><strong>DDD</strong> es un enfoque para desarrollar software con requisitos complejos y que tiene un vínculo profundo con un modelo que define el núcleo de la lógica comercial que se está desarrollando.\nLos mandamientos más importantes para desarrollar y mantener un modelo de dominio son:</p>\n<ul>\n<li>Situar el foco principal del proyecto en el core y la lógica de negocio del dominio.</li>\n<li>Todos los diseños complejos se basan en un modelo de dominio.</li>\n<li>Iniciar una colaboración creativa entre técnicos y expertos en modelos de dominio para definir iterativamente un modelo que aborde los problemas particulares del dominio.</li>\n</ul>\n<p>El <a href=\"http://domainlanguage.com/ddd/patterns/DDD_Reference_2011-01-31.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">Domain Driven Design</a> (5) no es una tecnología ni una metodología. Es un conjunto de patrones para la construcción de aplicaciones comerciales a partir del modelo de dominio, que proporciona una estructura útil, práctica y con una terminología consistente para la toma de decisiones en el curso del diseño de software.</p>\n<p><strong>Dominio:</strong> una esfera de conocimiento (ontología), influencia o actividad. El área donde un usuario aplica un programa es el dominio del software.\n<strong>Modelo:</strong> un conjunto de abstracciones que describen secciones de un dominio seleccionado que se pueden usar para resolver problemas o tareas relacionadas con ese dominio.\n<strong>Lenguaje ubicuo:</strong> un lenguaje estructurado en el contexto de un modelo de dominio y utilizado por todos los miembros del equipo para interconectar todas las actividades del equipo.\n<strong>Contexto:</strong> el escenario en el que una palabra o declaración define su significado.\nUna visión puramente técnica para el desarrollo de software podría ser la migración a una aplicación de múltiples capas (capa de persistencia, capa de datos de acceso, capa de servicio y capa de presentación).\n<strong>DDD</strong> no está en conflicto con ninguna tecnología o patrón de diseño, por ejemplo [Inyección de dependencia DI] (http://en.wikipedia.org/wiki/Dependency_injection) (6),</p>\n<p>pero sin cambios hay una premisa muy importante ¡El modelo de dominio debe permanecer aislado de las capas externas! ya que cualquier cambio tecnológico no debería afectar mi core business.</p>\n<p><strong>Premisa importante:</strong></p>\n<ul>\n<li>¡El modelo debe mantenerse aislado de las capas externas! La razón: ningún cambio tecnológico debe afectar al núcleo del negocio.</li>\n<li>Cada capa es un círculo concéntrico que define un área de software; mientras se mueve desde el centro hacia los niveles exteriores, el software evoluciona. Los círculos exteriores son mecanismos, mientras que los círculos interiores son las condiciones.</li>\n<li>La regla más importante para esta arquitectura es la regla de dependencia.</li>\n<li>Como regla general, las dependencias dentro del código fuente solo pueden apuntar hacia el centro. Nada en un círculo interior puede saber nada en un círculo exterior. Además, cualquier nombre declarado en un círculo exterior no puede ser mencionado por el código de un círculo interior. Esto incluye llamadas a funciones, clases, variables o cualquier otra entidad de software.</li>\n<li>Por la misma razón, los formatos de datos utilizados en un círculo exterior no pueden ser utilizados por un círculo interior, especialmente si estos formatos se generan en un ORM desde un círculo exterior. Nuestra intención es que nada de un círculo exterior afecte a los círculos interiores.</li>\n<li>Así, para la interacción entre círculos o capas es primordial establecer una API que permita la comunicación entre capas internas y externas mediante adaptadores o mensajes.</li>\n</ul>\n<p>Hay algunas arquitecturas basadas en esta vista; son similares y difieren en algunos puntos, pero coinciden en la importancia de un modelo de dominio <a href=\"http://alistair.cockburn.us/Hexagonal+architecture\" target=\"_blank\" rel=\"noopener noreferrer\">Arquitectura hexagonal</a> (7), [Arquitectura cebolla](http:// www.infoq.com/news/2014/10/ddd-onion-architecture) (8), [La arquitectura limpia] (http://blog.8thlight.com/uncle-bob/2012/08/13/the- arquitectura limpia.html) (9).</p>\n<p>Como la forma de definir cómo construiremos el software alrededor de ADempiere es crucial, adoptaremos la arquitectura limpia/Onion, donde el enfoque principal es mantener limpio el modelo de dominio interactuando con las capas externas por medio de contratos (API o interfaces) que permiten separar convenientemente el modelo de dominio de las implementaciones (API o contrato). Esto permitirá una evolución ordenada evitando la obsolescencia tecnológica.</p>\n<p>Por otro lado, definiremos un <a href=\"http://en.wikipedia.org/wiki/Domain-specific_language\" target=\"_blank\" rel=\"noopener noreferrer\">DSL de Lenguaje Específico de Dominio</a> (10) para ADempiere enfocado al negocio, que permita construir nuestro lenguaje ubicuo y delimitando claramente los contextos. Esto ayuda a un desarrollo más natural de la lógica empresarial.\nComo se dijo antes, toda decisión tiene que ser autorizada por los beneficios a obtener; avanzar hacia DDD nos permitirá obtener los siguientes beneficios:</p>\n<p><strong>Los beneficios:</strong></p>\n<ul>\n<li>Código desacoplado</li>\n<li>Reducir el código de espagueti</li>\n<li>Servicios transversales independientes del modelo de dominio (Log, Transacciones, Seguridad).</li>\n<li>Código fácil de mantener</li>\n<li>Software adaptable a cambios</li>\n<li>Diseño basado en componentes</li>\n<li>Contextos delimitados por el proceso de negocio</li>\n<li>Construir nuestros propios conjuntos de prueba (funcional, integración, prueba de regresión)</li>\n<li>Mejor manejo de dependencias y modularidad.</li>\n<li>Crear un DSL (lenguaje específico del dominio) (9) para la empresa</li>\n<li>Compilación de Adempiere como un sistema reactivo (11) (Responsive, Resilient, Elastic, Message Driver)</li>\n<li>Una aplicación diseñada para las exigencias de hoy</li>\n</ul>\n<p>Es importante que los desarrolladores interesados ​​en participar en este gran proyecto se familiaricen con los conceptos y la terminología.</p>\n<p>En los próximos meses y semanas seguiré escribiendo más artículos con ejemplos concretos que permitan la discusión.</p>\n<p>Víctor Pérez\nUn fundador de ADempiere\nvictor.perez@e-evolution.com</p>\n<p>Referencias:</p>\n<ul>\n<li>(1) <a href=\"http://en.wikipedia.org/wiki/Client%E2%80%93server_model\" target=\"_blank\" rel=\"noopener noreferrer\">http://en.wikipedia.org/wiki/Client–server_model</a></li>\n<li>(2) <a href=\"http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller\" target=\"_blank\" rel=\"noopener noreferrer\">http://en.wikipedia.org/wiki/Model–view–controller</a></li>\n<li>(3) <a href=\"http://en.wikipedia.org/wiki/Model-driven_architecture\" target=\"_blank\" rel=\"noopener noreferrer\">http://en.wikipedia.org/wiki/Model-driven_architecture</a></li>\n<li>(4) <a href=\"http://en.wikipedia.org/wiki/Domain-driven_design\" target=\"_blank\" rel=\"noopener noreferrer\">http://en.wikipedia.org/wiki/Domain-driven_design</a></li>\n<li>(5) <a href=\"http://domainlanguage.com/ddd/patterns/DDD_Reference_2011-01-31.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">http://domainlanguage.com/ddd/patterns/DDD_Reference_2011-01-31.pdf</a></li>\n<li>(6) <a href=\"http://en.wikipedia.org/wiki/Dependency_injection\" target=\"_blank\" rel=\"noopener noreferrer\">http://en.wikipedia.org/wiki/Dependency_injection</a></li>\n<li>(7) <a href=\"http://alistair.cockburn.us/Hexagonal+architecture\" target=\"_blank\" rel=\"noopener noreferrer\">http://alistair.cockburn.us/Hexagonal+architecture</a></li>\n<li>(8) <a href=\"http://www.infoq.com/news/2014/10/ddd-onion-architecture\" target=\"_blank\" rel=\"noopener noreferrer\">http://www.infoq.com/news/2014/10/ddd-onion-architecture</a></li>\n<li>(9) [http://blog.8thlight.com/uncle-bob/2012/08/13/the-clean-architecture.html](http://blog.8thlight.com/uncle-bob/2012/ 13/08/la-arquitectura-limpia.html)</li>\n<li>(10) <a href=\"http://en.wikipedia.org/wiki/Domain-specific_language\" target=\"_blank\" rel=\"noopener noreferrer\">http://en.wikipedia.org/wiki/Domain-specific_language</a></li>\n<li>(11) <a href=\"http://www.reactivemanifesto.org\" target=\"_blank\" rel=\"noopener noreferrer\">http://www.reactivemanifesto.org</a></li>\n</ul>\n",
      "date_published": "2022-07-19T23:06:56.000Z",
      "date_modified": "2022-12-20T15:55:05.000Z",
      "authors": [],
      "tags": [
        "Articulos"
      ]
    },
    {
      "title": "Anuncio mundial del nuevo y mejorado portal de contenido de ADempiere",
      "url": "https://github.com/adempiere/adempiere-site.github.io/es/about/articles/2015-08-06-world-announcement-for-adempiere.html",
      "id": "https://github.com/adempiere/adempiere-site.github.io/es/about/articles/2015-08-06-world-announcement-for-adempiere.html",
      "content_html": "<p>Nos complace anunciar el lanzamiento de un nuevo y mejorado portal de contenido para ADempiere alcanzando así otro hito tras el lanzamiento de la versión 380, lo que confirma la tracción y el compromiso de nuestra comunidad y de todos los que están detrás de este gran proyecto Bazaar.</p>\n<p>Un grupo de personas comprometidas trabajó arduamente durante varios meses para crear un sitio profesional e informativo para nuestra solución comercial, un lugar donde las personas encontrarán toda la información necesaria para evaluar nuestras herramientas de gestión de procesos, rompiendo la dependencia de un proveedor de software en particular y evitando licencias altas. costos y, lo que es más importante, no requerir compromisos a largo plazo de terceros para instalarlo, ampliarlo y/o personalizarlo.</p>\n<p>El portal ofrece una descripción general de la historia, la funcionalidad, las características, los beneficios y las historias de éxito de ADempiere, pero también permite descargar rápidamente un instalador, acceder rápidamente al código fuente, rastrear errores y explorar los foros para aprender de otras organizaciones que utilizan Adempiere en todo el mundo.</p>\n<p>Se ha adoptado una nueva plataforma de publicación que permitirá un mantenimiento más efectivo y estar al día con la documentación del proyecto para las mejoras actuales y futuras de forma regular.</p>\n<p>También nos hemos alejado del repositorio histórico de SourceForge a un sistema de control de versiones más profesional y seguro, por lo que todo el código y la plataforma de colaboración ADempiere se trasladaron a Git: www.github.com/Adempiere, que alberga cientos de proyectos de código abierto con miles de desarrolladores trabajando. de forma activa y colaborativa para el éxito de sus propios proyectos. También movimos la distribución de binarios a http://www.bintray.com/adempiere, que también sirve a muchos otros proyectos de código abierto de software profesional y libre de malware.</p>\n<p>Comenzamos con una nueva herramienta para administrar y controlar los foros de discusión donde la comunidad administrará la información y el conocimiento, lo que le permitirá crear una base de conocimiento para el beneficio de todos los involucrados.\nOn the other hand we are in the process of migrating information from the old sourceforge forums to our platform to protect the knowledge generated by the 10-year project.</p>\n<p>Hemos creado una sala de chat para que los desarrolladores colaboren en el desarrollo de futuras versiones dentro de http://gitter.im/adempiere. El canal es público y cualquier persona con una cuenta de github puede acceder y participar libremente.</p>\n<p>Un punto adicional importante que vale la pena mencionar es que el portal es un lugar donde las partes interesadas pueden encontrar servicios de consultoría empresarial de expertos profesionales, socios certificados y experimentados que han implementado Adempiere con éxito a lo largo de los años.</p>\n<p>Hemos creado un programa de certificación que permite a nuestros asociados calificar mediante casos documentados exitosamente garantizando la calidad y conocimiento de la solución.</p>\n<p>Incorporar un plan de formación para formar consultores expertos en ADempiere que implementen las mejores prácticas empresariales en el proceso de venta, gestión de distribución, cadena de suministro, fabricación, control de producción, gestión financiera y capital humano.</p>\n<p>Establecimos un proceso de contribución muy exitoso integrando las mejores características del negocio y validado en implementaciones exitosas, permitiendo a los clientes los beneficios que no se obtienen de los fabricantes de software propietario ya que este proyecto al ser liderado por la comunidad, los clientes dictan mejoras y funcionalidades para futuras versiones.</p>\n<p>Para la versión 4 nos enfocaremos en la renovación tecnológica para competir con las demandas de hoy, creando una nueva UI para dispositivos móviles y el desarrollo de una nueva interfaz web con soporte para HTML5 responsive, en la próxima versión ADempiere soportará Java 8 conscientemente decidido esperar el lanzamiento de Java 9, en particular el proyecto Jigsaw que se convertirá en el estándar para la modularización de Java.</p>\n<p>Queremos agradecer a todos los colaboradores que hicieron esta gran empresa, invito a todo aquel que quiera colaborar con este gran proyecto.</p>\n<p>Sinceramente</p>\n<p>Víctor Pérez Juárez</p>\n<p>Fundador de ADempiere</p>\n<p>En nombre de la Comunidad de ADempiere</p>\n",
      "date_published": "2015-08-06T00:00:00.000Z",
      "date_modified": "2022-11-09T12:27:08.000Z",
      "authors": [
        {
          "name": "Victor Pérez"
        }
      ],
      "tags": [
        "Articulos"
      ]
    },
    {
      "title": "Conferencia Berlin 2009",
      "url": "https://github.com/adempiere/adempiere-site.github.io/es/about/meeting/berlin-2009.html",
      "id": "https://github.com/adempiere/adempiere-site.github.io/es/about/meeting/berlin-2009.html",
      "content_html": "<h2 id=\"_2do-conferencia-europea-adempiere-en-berlin\" tabindex=\"-1\"> 2do. Conferencia europea ADempiere en Berlín</h2>\n<p><strong>21 al 23 de junio de 2009</strong></p>\n<p>Por primera vez en mayo de 2007, desarrolladores de todo el mundo, involucrados en el proyecto de código abierto ADempiere, se reunieron para la primera conferencia europea ADempiere en el FHTW de Berlín.</p>\n<p>Aunque el líder del proyecto Red1 es de la opinión de que las posibilidades que uno tiene con Internet hoy en día son suficientes para conectar a los miembros del equipo y tener éxito en proyectos como ADempiere, Internet sigue siendo un lugar virtual con una comunidad virtual.</p>\n<p>Con esta primera conferencia, cada miembro de la comunidad &quot;ADempiere Bazaar&quot; pasó de ser una persona virtual a una persona real para todos los demás; los apodos se convirtieron en nombres reales y rostros reales. Este intercambio personal entre los miembros de la comunidad conduce a una buena aceleración en el desarrollo del proyecto.</p>\n<p>Para involucrar a todos en otro encuentro personal, la 2ª conferencia europea ADempiere tendrá lugar en Berlín del 21 al 23 de junio.</p>\n<p>La conferencia se centrará en las mejoras técnicas de ADempiere y en la optimización de la estructura social de la comunidad de ADempiere para tener aún más éxito en términos de desarrollo y distribución.</p>\n<p>En total, utilizaremos el fin de semana para intercambiar experiencias personales con el software, así como para mejorar la documentación, el código y la localización, ¡y por supuesto para divertirnos mucho!</p>\n",
      "date_published": "2022-07-19T23:06:56.000Z",
      "date_modified": "2022-08-26T17:59:34.000Z",
      "authors": [],
      "tags": [
        "Base"
      ]
    },
    {
      "title": "Conferencia Mundial ADempiere en Berlín",
      "url": "https://github.com/adempiere/adempiere-site.github.io/es/about/meeting/berlin-2014.html",
      "id": "https://github.com/adempiere/adempiere-site.github.io/es/about/meeting/berlin-2014.html",
      "content_html": "<h1 id=\"conferencia-mundial-adempiere-en-berlin\" tabindex=\"-1\"> Conferencia Mundial ADempiere en Berlín</h1>\n<p><strong>2 al 4 de septiembre de 2014</strong></p>\n<p>En mayo de 2007, la primera conferencia europea ADempiere en Berlín, organizada por la asociación alemana ADempiere, reunió a desarrolladores de todo el mundo.</p>\n<p>Aprovechando esta exitosa primera conferencia, la comunidad &quot;ADempiere Bazaar&quot; se reunió nuevamente para la segunda conferencia europea en 2009; paso a paso transformándose de una comunidad virtual a una comunidad real.</p>\n<p>Comenzando como solo la asociación alemana ADempiere, estas convincentes conferencias trajeron progreso y nuevos miembros a la comunidad, de modo que la asociación tuvo la oportunidad de abrirse y cambiar su nombre para convertirse en la &quot;asociación ADempiere&quot; con orientación internacional. El siguiente paso para reunir a desarrolladores de todo el mundo no es la Conferencia Europea, sino la Conferencia Mundial.</p>\n<p>Ahora, por primera vez en septiembre de 2011, la Conferencia Mundial ADempiere se lleva a cabo en la Universidad Técnica de Beuth en Berlín.</p>\n<p>La conferencia intenta reunir a todas las partes interesadas en ADempiere: miembros de la comunidad, proveedores de servicios, usuarios o personas interesadas únicamente en ADempiere.</p>\n<p>Los desarrolladores notables de ADempiere compartirán su conocimiento de ADempiere en charlas o talleres con valiosos consejos de mejores prácticas y casos de uso del mundo real.</p>\n<p>Podemos decir por el rápido aumento del número de participantes internacionales en la conferencia que la comunidad estaba esperando desesperadamente un evento como este.</p>\n<p>&quot;El interés y los comentarios que recibimos por la conferencia mundial son solo una prueba más de la colaboración global de los miembros de la comunidad y la creciente red en torno a ADempiere. Espero con ansias otra gran experiencia con este espíritu positivo y progresista que rodea a la comunidad&quot;. – Kai Schaeffer, presidente de la asociación ADempiere.</p>\n<p>Otro punto de la agenda de la Conferencia Mundial es la asamblea general de la asociación y la elección de un nuevo presidente.</p>\n<p>Por supuesto, el fin de semana también se utilizará para incorporar eventos sociales para conocernos más e intercambiar conocimientos y experiencias.</p>\n",
      "date_published": "2022-07-19T23:06:56.000Z",
      "date_modified": "2022-08-26T18:04:32.000Z",
      "authors": [],
      "tags": []
    }
  ]
}